
public class OOP {
	/* 
	 *객체지향 프로그래밍(Object Oriented Programming)
	 * 	 우리 일상에서 이루어지고 있는 업무를 객체(Object)를 사용해서
	 *   프로그래밍 하는 방법
	 *   
	 *    1. 실제 주차장 관리 업무 파악
	 *      (객체를 도출하고 그객체들의 관계에 의한 업무 파악) 
	 *    2. 프로그램으로 작성 
	 *      (1번에서 파악된 업무를 메모리 상에서 그대로 구현) 
	 *   
	 *    ex> 주차 관리 프로그램 
	 *     
	 * 
	 * 	 - 객체(업무):실제 이루어지고 있는 업무(주차장)에서 보여지고
	 *               구체화되어 있는 사물(차)    
	 *   
	 *   - 객체(프로그램):실제 이루어지고 있는 업무(주차장)에서 보여지고
	 *                  구체화되어 있는 사물을 메모리의 데이타로
	 *                  표현한 것(차의 데이타)
	 *                   
	 * 
	 * 
	 * 
	 * 
	 */
}
